{
  "architectures": [
    "Blip2ForConditionalGeneration"
  ],
  "dtype": "float32",
  "image_text_hidden_size": 256,
  "image_token_index": 50265,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "model_type": "blip-2",
  "num_query_tokens": 32,
  "qformer_config": {
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "cross_attention_frequency": 2,
    "dtype": "float32",
    "encoder_hidden_size": 1408,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "blip_2_qformer",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 0,
    "use_qformer_text_input": false,
    "vocab_size": 30522
  },
  "quantization_config": {
    "_load_in_4bit": true,
    "_load_in_8bit": false,
    "bnb_4bit_compute_dtype": "float16",
    "bnb_4bit_quant_storage": "uint8",
    "bnb_4bit_quant_type": "nf4",
    "bnb_4bit_use_double_quant": false,
    "llm_int8_enable_fp32_cpu_offload": false,
    "llm_int8_has_fp16_weight": false,
    "llm_int8_skip_modules": null,
    "llm_int8_threshold": 6.0,
    "load_in_4bit": true,
    "load_in_8bit": false,
    "quant_method": "bitsandbytes"
  },
  "text_config": {
    "_name_or_path": "facebook/opt-2.7b",
    "_remove_final_layer_norm": false,
    "activation_dropout": 0.0,
    "activation_function": "relu",
    "architectures": [
      "OPTForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 2,
    "do_layer_norm_before": true,
    "dropout": 0.1,
    "dtype": "float32",
    "enable_bias": true,
    "eos_token_id": 50118,
    "ffn_dim": 10240,
    "hidden_size": 2560,
    "init_std": 0.02,
    "layer_norm_elementwise_affine": true,
    "layerdrop": 0.0,
    "max_position_embeddings": 2048,
    "model_type": "opt",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "pad_token_id": 1,
    "prefix": "</s>",
    "tie_word_embeddings": true,
    "use_cache": true,
    "vocab_size": 50304,
    "word_embed_proj_dim": 2560
  },
  "transformers_version": "5.14.1",
  "use_decoder_only_language_model": true,
  "vision_config": {
    "attention_dropout": 0.0,
    "dropout": 0.0,
    "dtype": "float32",
    "hidden_act": "gelu",
    "hidden_size": 1408,
    "image_size": 224,
    "initializer_factor": 1.0,
    "initializer_range": 1e-10,
    "intermediate_size": 6144,
    "layer_norm_eps": 1e-06,
    "model_type": "blip_2_vision_model",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 39,
    "patch_size": 14,
    "projection_dim": 512,
    "qkv_bias": true
  }
}
