{
  "add_prefix_space": false,
  "backend": "tokenizers",
  "bos_token": "</s>",
  "clean_up_tokenization_spaces": false,
  "eos_token": "</s>",
  "errors": "replace",
  "is_local": false,
  "local_files_only": false,
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "<pad>",
  "processor_class": "Blip2Processor",
  "tokenizer_class": "TokenizersBackend",
  "unk_token": "</s>"
}
